module ESMM_Config

  # 显示当前地图的名称，只是给作者选择，不在设置菜单内
  SHOW_CURRENT_MAP_NAME = true

  # 是否根据昼夜变化颜色，只是给作者选择，不在设置菜单内
  USE_DAYNIGHT_TONE = true

# 强制禁用的地图编号
BAN_MAPS = [
    1, 119,                                                   # 开始，荣耀殿堂
    224, 292, 293, 294, 295, 296,                             # 红枫雪域系列
    347,                                                      # 伊甸园
    60, 209, 210, 228, 297, 321, 371,                         # 裂缝系列
    140, 441, 442, 444,                                       # 尘封山系列
    417, 440, 443, 445, 446, 447, 448, 450, 451,              # 查伦剧情系列
    478, 485, 388, 462                                        # 创世系列
    ]
  # 小地图显示的层级
  MAP_Z = 99988

  # 小地图位置：左上、右上、左下、右下
  MAP_POSITION = [[0, 0],               [Graphics.width, 0],
                  [0, Graphics.height], [Graphics.width, Graphics.height]]

  # 小地图格子大小
  MAP_SIZE = [5, 7, 9, 11]

  # 小地图每格像素大小
  SQUARE = 16

  # 小地图缩放倍率
  # 最大小地图格子大小 / (地图图片像素高度 / 每隔像素大小) = 11 / (320 / 16) = 0.55
  # 小于0.55也行，但是最大尺寸+最小缩放时下面会空出一点
  MAP_ZOOM = [0.55, 1.0, 1.5, 2.0]
  
  # 小地图边框颜色
  BORDER_COLOR = [
    Color.new(0, 0, 0),       # 黑
    Color.new(255, 255, 255), # 白
    Color.new(255, 0, 0),     # 红
    Color.new(0, 255, 0),     # 绿
    Color.new(0, 0, 255),     # 蓝
    Color.new(255, 255, 0)    # 黄
  ]
  
end